STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Zigbee/Zigbee_IAS_WD_Client_Router/STM32_WPAN/App/app_zigbee.c
/**
  ******************************************************************************
  * File Name          : App/app_zigbee.c
  * Description        : Zigbee Application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2019-2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "app_common.h"
#include "app_entry.h"
#include "dbg_trace.h"
#include "app_zigbee.h"
#include "zigbee_interface.h"
#include "shci.h"
#include "stm_logging.h"
#include "app_conf.h"
#include "stm32wbxx_core_interface_def.h"
#include "zigbee_types.h"
#include "stm32_seq.h"

#include <assert.h>
#include "zcl/zcl.h"
#include "zcl/security/zcl.ias_wd.h"

/* Private defines -----------------------------------------------------------*/
#define APP_ZIGBEE_STARTUP_FAIL_DELAY               500U
#define SW1_ENDPOINT                                17
#define CHANNEL                                     19
#define UTIL_SEQ_NO_BIT_SET                         0
#define UTIL_SEQ_ALL_BIT_SET                        (~0)

/* IAS WD specific defines ---------------------------------------------------*/
#define MAX_DURATION_ATTR_VAL                       5
#define WARNING_DURATION_VAL                        15
#define STROBE_DUTYCYCLE_VAL                        20

/* external definition */
enum ZbStatusCodeT ZbStartupWait(struct ZigBeeT *zb, struct ZbStartupT *config);

/* Private function prototypes -----------------------------------------------*/
static void APP_ZIGBEE_StackLayersInit(void);
static void APP_ZIGBEE_ConfigEndpoints(void);
static void APP_ZIGBEE_SW1_Process(void);
static void APP_ZIGBEE_SW2_Process(void);
static void APP_ZIGBEE_NwkForm(void);
static void APP_ZIGBEE_App_Init(void);

static void APP_ZIGBEE_IAS_WD_Client_Init(void);
static void APP_ZIGBEE_IAS_WD_Client_Send_StartWarning_cmd(void);
static void APP_ZIGBEE_IAS_WD_Client_Send_Squawk_cmd(void);
static void APP_ZIGBEE_Generic_Cmd_Rsp_cb(struct ZbZclCommandRspT *zcl_rsp, void *arg);
static void APP_ZIGBEE_IAS_WD_Remote_Write_cb(const ZbZclWriteRspT *writeResp, void *cb_arg);

static void APP_ZIGBEE_TraceError(const char *pMess, uint32_t ErrCode);
static void APP_ZIGBEE_CheckWirelessFirmwareInfo(void);

static void Wait_Getting_Ack_From_M0(void);
static void Receive_Ack_From_M0(void);
static void Receive_Notification_From_M0(void);
static void APP_ZIGBEE_ProcessNotifyM0ToM4(void);
static void APP_ZIGBEE_ProcessRequestM0ToM4(void);
/* Private variables -----------------------------------------------*/
static TL_CmdPacket_t *p_ZIGBEE_otcmdbuffer;
static TL_EvtPacket_t *p_ZIGBEE_notif_M0_to_M4;
static TL_EvtPacket_t *p_ZIGBEE_request_M0_to_M4;
static __IO uint32_t CptReceiveNotifyFromM0 = 0;
static __IO uint32_t CptReceiveRequestFromM0 = 0;

PLACE_IN_SECTION("MB_MEM1") ALIGN(4) static TL_ZIGBEE_Config_t ZigbeeConfigBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t ZigbeeOtCmdBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ZigbeeNotifRspEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ZigbeeNotifRequestBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];
uint8_t g_ot_notification_allowed = 0U;

struct zigbee_app_info {
  bool has_init;
  struct ZigBeeT *zb;
  enum ZbStatusCodeT join_status;
  uint32_t join_delay;

  struct ZbZclClusterT *ias_wd_client_1;
};
static struct zigbee_app_info zigbee_app_info;

static UTIL_SEQ_bm_t RemoteWriteMaxDurationAttr_OK = UTIL_SEQ_ALL_BIT_SET;

/* Functions Definition ------------------------------------------------------*/

/**
 * @brief  Zigbee application initialization
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_App_Init(void){
  /* Initialize Zigbee IAS WD Client parameters */
  APP_ZIGBEE_IAS_WD_Client_Init();
} /* APP_ZIGBEE_App_Init */

static void APP_ZIGBEE_IAS_WD_Remote_Write_cb(const ZbZclWriteRspT *writeResp, void *cb_arg){
   UNUSED(cb_arg);
   
   if(writeResp->status != ZCL_STATUS_SUCCESS){
     APP_DBG("[IAS WD] Error, remote write failed.");
     assert(0);
   }
   
   if(writeResp->attr[0].attrId != ZCL_IAS_WD_SVR_ATTR_MAX_DURATION){
     APP_DBG("[IAS WD] Error, wrong attribute in response.");
     assert(0);
   }
   
   if(writeResp->attr[0].status != ZCL_STATUS_SUCCESS){
     APP_DBG("[IAS WD] Error, remotely write attribute failed.");
     assert(0);
   }
   
   UTIL_SEQ_SetEvt(RemoteWriteMaxDurationAttr_OK);
   APP_DBG("[IAS WD] Remote write OK."); 
}

/**
 * @brief  IAS WD client initialization
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_IAS_WD_Client_Init(void){
  enum ZclStatusCodeT status;  
  ZbZclWriteReqT RemoteWriteReq;
  uint16_t max_duration_attr = 0;
  
  /* Remotely write IAS WD server MaxDuration attribute */
  APP_DBG("[IAS WD] Remotely writing MaxDuration attribute..."); 
  memset(&RemoteWriteReq, 0, sizeof(RemoteWriteReq));
  RemoteWriteReq.dst.mode = ZB_APSDE_ADDRMODE_SHORT;
  RemoteWriteReq.dst.nwkAddr = 0x0;
  RemoteWriteReq.dst.endpoint = SW1_ENDPOINT;
  RemoteWriteReq.count = 1;
  RemoteWriteReq.attr[0].attrId = ZCL_IAS_WD_SVR_ATTR_MAX_DURATION;
  RemoteWriteReq.attr[0].type = ZCL_DATATYPE_UNSIGNED_16BIT;
  putle16((uint8_t*)&max_duration_attr, MAX_DURATION_ATTR_VAL);
  RemoteWriteReq.attr[0].value = (uint8_t const*)&max_duration_attr;
  RemoteWriteReq.attr[0].length = 2;
    
  status =   ZbZclWriteReq(zigbee_app_info.ias_wd_client_1, &RemoteWriteReq, APP_ZIGBEE_IAS_WD_Remote_Write_cb, NULL);
  if (status != ZCL_STATUS_SUCCESS) {
    APP_DBG("[IAS WD] Error, ZbZclWriteReq failed");
    assert(0);
  }
  
  /* Waiting for the successful return of the command */
  UTIL_SEQ_WaitEvt(RemoteWriteMaxDurationAttr_OK);
    
  APP_DBG("[IAS WD] IAS WD client init done!\n");  
} /* APP_ZIGBEE_IAS_WD_Client_Init */

/**
 * @brief  Sending IAS WD StartWarning command to server
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_IAS_WD_Client_Send_StartWarning_cmd(void){
  enum ZclStatusCodeT status;
  struct ZbApsAddrT dst;
  struct ZbZclIasWdClientStartWarningReqT req;
  
  /* Setting up the addressing mode */ 
  memset(&dst, 0, sizeof(dst));
  dst.mode = ZB_APSDE_ADDRMODE_SHORT;
  dst.nwkAddr = 0x0;
  dst.endpoint = SW1_ENDPOINT;
  
  /* Creating a request */
  memset(&req, 0, sizeof(req));
  req.warning_mode = ZCL_IAS_WD_WARNING_MODE_BURGLAR;
  req.warning_duration = (uint16_t) WARNING_DURATION_VAL;
  req.siren_level = ZCL_IAS_WD_LEVEL_MEDIUM;
  req.strobe = ZCL_IAS_WD_STROBE_ON;
  req.strobe_level = ZCL_IAS_WD_LEVEL_MEDIUM;
  req.strobe_dutycycle = (uint8_t) STROBE_DUTYCYCLE_VAL; /* strobe ON state duration in 1/100 of a second */
  
  APP_DBG("[IAS WD] Sending StartWarning command."); 
  status = ZbZclIasWdClientStartWarningReq(zigbee_app_info.ias_wd_client_1, &dst, &req, APP_ZIGBEE_Generic_Cmd_Rsp_cb, NULL);
  if (status != ZCL_STATUS_SUCCESS) {
    APP_DBG("[IAS WD] Error, ZbZclIasWdClientStartWarningReq failed");
    assert(0);
  } 
} /* APP_ZIGBEE_IAS_WD_Client_Send_StartWarning_cmd */

/**
 * @brief  Sending IAS WD Squawk command to server
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_IAS_WD_Client_Send_Squawk_cmd(void){
  enum ZclStatusCodeT status;
  struct ZbApsAddrT dst;
  struct ZbZclIasWdClientSquawkReqT req;
  
  /* Setting up the addressing mode */ 
  memset(&dst, 0, sizeof(dst));
  dst.mode = ZB_APSDE_ADDRMODE_SHORT;
  dst.nwkAddr = 0x0;
  dst.endpoint = SW1_ENDPOINT;
  
  /* Creating a request */
  memset(&req, 0, sizeof(req));
  req.squawk_mode = ZCL_IAS_WD_SQUAWK_MODE_ARMED;
  req.squawk_level = ZCL_IAS_WD_LEVEL_MEDIUM;
  req.strobe = ZCL_IAS_WD_STROBE_ON;
  
  APP_DBG("[IAS WD] Sending Squawk command."); 
  status = ZbZclIasWdClientSquawkReq(zigbee_app_info.ias_wd_client_1, &dst, &req, APP_ZIGBEE_Generic_Cmd_Rsp_cb, NULL);
  if (status != ZCL_STATUS_SUCCESS) {
    APP_DBG("[IAS WD] Error, ZbZclIasWdClientSquawkReq failed");
    assert(0);
  } 
} /* APP_ZIGBEE_IAS_WD_Client_Send_Squawk_cmd */

/**
 * @brief  Command response callback
 * @param  zcl_rsp: ZCL response
 * @param  arg: passed argument
 * @retval None
 */
static void APP_ZIGBEE_Generic_Cmd_Rsp_cb(struct ZbZclCommandRspT *zcl_rsp, void *arg){
  UNUSED(arg);
  
